In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("D:\\AIML\\Term 2\\Advanced Python AI and ML Tools\\Activities\\titanic.csv")
df.shape

(2207, 11)

In [3]:
df.head()

,name,gender,age,class,embarked,country,ticketno,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,5547.0,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,2673.0,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,2673.0,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,2673.0,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,348125.0,7.13,0.0,0.0,yes

In [4]:
df.drop(columns = "ticketno",inplace=True)

In [5]:
df.columns

Index(['name', 'gender', 'age', 'class', 'embarked', 'country', 'fare',
       'sibsp', 'parch', 'survived'],
      dtype='object')

In [6]:
df.age[1]

13.0

In [7]:
df.at[0,"age"]

42.0

In [8]:
df=df.set_index(df.name)

In [9]:
df.loc["Abbing, Mr. Anthony"]

name        Abbing, Mr. Anthony
gender                     male
age                        42.0
class                       3rd
embarked                      S
country           United States
fare                       7.11
sibsp                       0.0
parch                       0.0
survived                     no
Name: Abbing, Mr. Anthony, dtype: object

In [10]:
df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
name,,,,,,,,,,
"Abbott, Mr. Eugene Joseph","Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
"Abbott, Mr. Rossmore Edward","Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
"Abbott, Mrs. Rhoda Mary 'Rosa'","Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [11]:
df.index.name

'name'

In [12]:
df.reset_index(drop=True,inplace=True)

In [13]:
df.index.name

In [14]:
df.loc["Abbing, Mr. Anthony","United States"] #the name column is not set as index column

KeyError: 'United States'

In [15]:
df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

In [16]:
df[( (df["gender"]=="female") & (df["age"]>50) ) |((df["gender"]=="male") & (df["age"]<20) )].shape

(244, 10)

In [17]:
df["gender"].replace(["female","male"],["W","M"],inplace=True)

In [18]:
df["sex"]=df.gender.replace(["W","M"],[1,0])
df.sex.value_counts()

sex
0    1718
1     489
Name: count, dtype: int64

In [19]:
df["survived_ind"] = df["survived"].replace(["yes","no"],[1,0])

In [20]:
df.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind
0,"Abbing, Mr. Anthony",M,42.0,3rd,S,United States,7.11,0.0,0.0,no,0,0
1,"Abbott, Mr. Eugene Joseph",M,13.0,3rd,S,United States,20.05,0.0,2.0,no,0,0
2,"Abbott, Mr. Rossmore Edward",M,16.0,3rd,S,United States,20.05,1.0,1.0,no,0,0
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",W,39.0,3rd,S,England,20.05,1.0,1.0,yes,1,1
4,"Abelseth, Miss. Karen Marie",W,16.0,3rd,S,Norway,7.13,0.0,0.0,yes,1,1

### Cross Tab

In [21]:
pd.crosstab(df["sex"],df["gender"],margins=True, margins_name="total")

gender     M    W  total
sex
0       1718    0   1718
1          0  489    489
total   1718  489   2207

In [22]:
tab = pd.crosstab(df["survived"],[df["gender"],df["class"]],margins=True,margins_name="total")

In [23]:
tab

gender      M                                                        \
class     1st  2nd  3rd deck crew engineering crew restaurant staff
survived
no        118  154  418        23              253               66
yes        62   24   75        43               71                1
total     180  178  493        66              324               67

gender                       W                                              \
class    victualling crew  1st  2nd  3rd restaurant staff victualling crew
survived
no                    334    5   12  110                0                3
yes                    76  139   94  106                2               18
total                 410  144  106  216                2               21

gender   total
class
survived
no        1496
yes        711
total     2207

In [24]:
df.rename(columns = {"class":"passenger_class"},inplace=True)

In [25]:
df.columns

Index(['name', 'gender', 'age', 'passenger_class', 'embarked', 'country',
       'fare', 'sibsp', 'parch', 'survived', 'sex', 'survived_ind'],
      dtype='object')

### checking for null values

In [26]:
df[df["age"].isnull()].shape[0]

2

### checking for non-null values

In [27]:
df[df["age"].notna()].shape[0]

2205

In [28]:
df[df["age"].isnull() ==False].shape[0]

2205

### Summary Statistics

In [30]:
df.country.nunique()

48

In [31]:
df.country.unique()

array(['United States', 'England', 'Norway', 'France', 'Lebanon',
       'Finland', 'Sweden', 'Argentina', 'Canada', 'Denmark',
       'Northern Ireland', 'Bulgaria', 'Switzerland', 'Channel Islands',
       'Bosnia', 'Hungary', nan, 'Ireland', 'Italy', 'India', 'Wales',
       'South Africa', 'Croatia (Modern)', 'Scotland', 'Siam', 'Uruguay',
       'Belgium', 'Poland', 'Australia', 'Peru', 'Spain', 'Egypt',
       'Japan', 'Syria', 'Russia', 'Slovenia', 'Greece', 'Turkey',
       'China/Hong Kong', 'Austria', 'Latvia', 'Yugoslavia',
       'Slovakia (Modern day)', 'Germany', 'Croatia', 'Cuba',
       'Netherlands', 'Mexico', 'Guyana'], dtype=object)

In [32]:
df.country.value_counts()

country
England                  1125
United States             264
Ireland                   137
Sweden                    105
Lebanon                    71
Finland                    54
Scotland                   36
Canada                     34
Norway                     26
France                     26
Belgium                    22
Northern Ireland           21
Wales                      20
Bulgaria                   19
Switzerland                18
Channel Islands            17
Croatia (Modern)           12
Croatia                    11
Italy                      11
Spain                       9
India                       8
Hungary                     7
Denmark                     7
Argentina                   7
South Africa                6
Germany                     6
Turkey                      6
Australia                   5
Slovenia                    4
Bosnia                      4
Poland                      3
Austria                     3
Netherlands                 2
Greece                      2
Uruguay                     2
Russia                      2
Peru                        2
Siam                        2
Syria                       1
China/Hong Kong             1
Japan                       1
Latvia                      1
Yugoslavia                  1
Slovakia (Modern day)       1
Egypt                       1
Cuba                        1
Mexico                      1
Guyana                      1
Name: count, dtype: int64

In [35]:
pd.crosstab(df["survived"],df["passenger_class"],margins=True, margins_name = "total")

passenger_class,1st,2nd,3rd,deck crew,engineering crew,restaurant staff,victualling crew,total
survived,,,,,,,,
no,123,166,528,23,253,66,337,1496
yes,201,118,181,43,71,3,94,711
total,324,284,709,66,324,69,431,2207

In [33]:
df.columns

Index(['name', 'gender', 'age', 'passenger_class', 'embarked', 'country',
       'fare', 'sibsp', 'parch', 'survived', 'sex', 'survived_ind'],
      dtype='object')

#### create new table one column the  of survived/not survived with the percentage of passenger from each  country

In [51]:
df.groupby(["survived","country"])[["survived"]].count()

                        survived
survived country
no       Argentina             7
         Australia             5
         Austria               2
         Belgium              17
         Bosnia                4
...                          ...
yes      Switzerland          11
         Syria                 1
         Turkey                2
         United States       152
         Wales                 3

[77 rows x 1 columns]

In [58]:
df["company"] = df.sibsp+df.parch
df.groupby("gender")["company"].mean()

gender
M    0.663496
W    1.285408
Name: company, dtype: float64

In [59]:
df.groupby("gender")["age"].mean()

gender
M    30.843969
W    29.042434
Name: age, dtype: float64

In [60]:
pd.DataFrame(df.groupby(["gender","survived_ind"])["age"].mean())

                           age
gender survived_ind
M      0             31.292461
       1             29.106061
W      0             26.053846
       1             30.124652

In [61]:
df.groupby("gender")["name"].count()

gender
M    1718
W     489
Name: name, dtype: int64

In [66]:
df.groupby("gender").count()

,name,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind,company
gender,,,,,,,,,,,,
M,1718,1716,1718,1718,1662,825,841,841,1718,1718,1718,841
W,489,489,489,489,464,466,466,466,489,489,489,466

In [67]:
df.groupby("gender").apply(lambda x:x.count())

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind,company
gender,,,,,,,,,,,,,
M,1718,1718,1716,1718,1718,1662,825,841,841,1718,1718,1718,841
W,489,489,489,489,489,464,466,466,466,489,489,489,466

In [68]:
def uppercase(x):
    return x.upper()

In [72]:
df["new_col"] = df["name"].apply(lambda x : uppercase(x))

In [73]:
for name in  df["new_col"][:3]:
    print(name)

ABBING, MR. ANTHONY
ABBOTT, MR. EUGENE JOSEPH
ABBOTT, MR. ROSSMORE EDWARD

In [76]:
[name for name in df["new_col"][:3]]

['ABBING, MR. ANTHONY',
 'ABBOTT, MR. EUGENE JOSEPH',
 'ABBOTT, MR. ROSSMORE EDWARD']

In [77]:
[name[:3] for name in df["new_col"][:3]]

['ABB', 'ABB', 'ABB']

In [89]:
data_a = {"id":["1","2","3"], "first":["Sonal","Aparna","Jharana"],"last":["Parmar","Suresh","Adhikari"]}

In [90]:
data_a= pd.DataFrame(data_a,columns = ["id","first","last"])

In [91]:
data_b = {"id":["4","5","6"], "first":["Uma","Yasaswin","Raemil"],"last":["Maheshwari","Palukuri","Comerio"]}
data_b= pd.DataFrame(data_b,columns = ["id","first","last"])

In [92]:
pd.concat([data_a,data_b], axis=0)

  id     first        last
0  1     Sonal      Parmar
1  2    Aparna      Suresh
2  3   Jharana    Adhikari
0  4       Uma  Maheshwari
1  5  Yasaswin    Palukuri
2  6    Raemil     Comerio

In [99]:
emplyee_data = {"employee_id":[1,2,3,4],"name":["Sonal Parmar","Mahesh Rajpurohit","Nidhi Joshi","Nisha Parmar"]}
emplyee_data= pd.DataFrame(emplyee_data,columns = ["employee_id","name"])

In [100]:
sales_data = {"employee_id":[3,4,5,6],"total_sales":[23456,3456,2356,4675]}
sales_data= pd.DataFrame(sales_data,columns = ["employee_id","total_sales"])

In [101]:
pd.merge(emplyee_data,sales_data, on = "employee_id")

   employee_id          name  total_sales
0            3   Nidhi Joshi        23456
1            4  Nisha Parmar         3456

In [102]:
pd.merge(emplyee_data,sales_data, left_on = "employee_id",right_on = "employee_id")

   employee_id          name  total_sales
0            3   Nidhi Joshi        23456
1            4  Nisha Parmar         3456

In [104]:
emplyee_data.set_index("employee_id")

                          name
employee_id
1                 Sonal Parmar
2            Mahesh Rajpurohit
3                  Nidhi Joshi
4                 Nisha Parmar